<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"1a01e1dea58435e62137af5567d69d23d42b970895b665bf1768d38bd5fbb6e5","plan_job_ref":"Job Write Terraform Plan to Pull Request #63 at https://github.com/hackforla/devops-security/actions/runs/12019955295","plan_out_hash":"52dcda9473e0aac0b7bff6fa9503480ee55befe733c25d1ea18dbf2bfd4b8212","plan_hash":"7678d45893177ecd5c4f257cae37ec3ec906a884f712cf7bc38a2938eeb3db49","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 3 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.iam_oidc_gha_incubator.aws_iam_role.github_actions_oidc will be updated in-place
!~  resource "aws_iam_role" "github_actions_oidc" {
!~      assume_role_policy    = jsonencode(
!~          {
!~              Statement = [
!~                  {
!~                      Condition = {
!~                          StringLike   = {
!~                              "token.actions.githubusercontent.com:sub" = "*************************************************************************"
                            }
#                            (1 unchanged attribute hidden)
                        }
#                        (3 unchanged attributes hidden)
                    },
                ]
#                (1 unchanged attribute hidden)
            }
        )
        id                    = "gha-incubator"
        name                  = "gha-incubator"
        tags                  = {}
#        (11 unchanged attributes hidden)
    }

  # module.iam_user_alexe.aws_iam_user_group_membership.user_group_membership will be updated in-place
!~  resource "aws_iam_user_group_membership" "user_group_membership" {
!~      groups = [
-           "ops-leads",
+           "read-only-group",
        ]
        id     = "terraform-20240815021728326500000001"
#        (1 unchanged attribute hidden)
    }

  # module.iam_user_herehfla.aws_iam_user.user will be created
+   resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "herehfla"
+       path          = "/"
+       tags          = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       tags_all      = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       unique_id     = (known after apply)
    }

  # module.iam_user_herehfla.aws_iam_user_group_membership.user_group_membership will be created
+   resource "aws_iam_user_group_membership" "user_group_membership" {
+       groups = [
+           "read-only-group",
        ]
+       id     = (known after apply)
+       user   = "herehfla"
    }

  # module.iam_user_herehfla.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "herehfla"
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #63](https://github.com/hackforla/devops-security/actions/runs/12019955295)